#### Terraform Plan for bootstrap 📖 `success`

<details><summary>Show Plan</summary>

```

aws_route53_zone.accounting: Refreshing state... [id=Z047058117NM6D6MGKBNH]
aws_iam_user.grafana_monitoring: Refreshing state... [id=grafana-monitoring]
aws_s3_bucket.lambda_source: Refreshing state... [id=mersthamcc-accounts-deployment-versioned]
aws_iam_policy.grafana_monitoring: Refreshing state... [id=arn:aws:iam::755836339707:policy/grafana-monitoring]
aws_iam_access_key.grafana_monitoring: Refreshing state... [id=AKIA27623IX5QEPXMUP5]
aws_iam_role.grafana_monitoring: Refreshing state... [id=grafana-monitoring-role]
aws_iam_role_policy_attachment.grafana_monitoring: Refreshing state... [id=grafana-monitoring-role-20220522140202339700000001]
digitalocean_record.nameservers["ns-68.awsdns-08.com"]: Refreshing state... [id=313419430]
digitalocean_record.nameservers["ns-912.awsdns-50.net"]: Refreshing state... [id=313419428]
digitalocean_record.nameservers["ns-1823.awsdns-35.co.uk"]: Refreshing state... [id=313419429]
digitalocean_record.nameservers["ns-1396.awsdns-46.org"]: Refreshing state... [id=313419427]
aws_s3_bucket_acl.example_bucket_acl: Refreshing state... [id=mersthamcc-accounts-deployment-versioned,private]
aws_s3_bucket_versioning.lambda_source_versioning: Refreshing state... [id=mersthamcc-accounts-deployment-versioned]
aws_s3_bucket_lifecycle_configuration.lambda_source_lifecycle_configuration: Refreshing state... [id=mersthamcc-accounts-deployment-versioned]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_iam_access_key.grafana_monitoring has been deleted
  - resource "aws_iam_access_key" "grafana_monitoring" {
      - create_date          = "2022-05-22T14:01:44Z" -> null
      - id                   = "AKIA27623IX5QEPXMUP5" -> null
      - secret               = (sensitive value)
      - ses_smtp_password_v4 = (sensitive value)
      - status               = "Active" -> null
      - user                 = "grafana-monitoring" -> null
    }

  # aws_iam_policy.grafana_monitoring has been deleted
  - resource "aws_iam_policy" "grafana_monitoring" {
      - arn       = "arn:aws:iam::755836339707:policy/grafana-monitoring" -> null
      - id        = "arn:aws:iam::755836339707:policy/grafana-monitoring" -> null
      - name      = "grafana-monitoring" -> null
      - path      = "/" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "cloudwatch:ListMetrics",
                          - "cloudwatch:GetMetricStatistics",
                          - "cloudwatch:GetMetricData",
                          - "cloudwatch:DescribeAlarmsForMetric",
                          - "cloudwatch:DescribeAlarms",
                          - "cloudwatch:DescribeAlarmHistory",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "AllowReadingMetricsFromCloudWatch"
                    },
                  - {
                      - Action   = [
                          - "logs:StopQuery",
                          - "logs:StartQuery",
                          - "logs:GetQueryResults",
                          - "logs:GetLogGroupFields",
                          - "logs:GetLogEvents",
                          - "logs:DescribeLogGroups",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "AllowReadingLogsFromCloudWatch"
                    },
                  - {
                      - Action   = [
                          - "ec2:DescribeTags",
                          - "ec2:DescribeRegions",
                          - "ec2:DescribeInstances",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "AllowReadingTagsInstancesRegionsFromEC2"
                    },
                  - {
                      - Action   = "tag:GetResources"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "AllowReadingResourcesForTags"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id = "ANPA27623IX5XBBQRQEOA" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
    }

  # aws_iam_role.grafana_monitoring has been deleted
  - resource "aws_iam_role" "grafana_monitoring" {
      - arn                   = "arn:aws:iam::755836339707:role/grafana-monitoring-role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::755836339707:user/grafana-monitoring"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2022-05-22T14:02:01Z" -> null
      - force_detach_policies = false -> null
      - id                    = "grafana-monitoring-role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::755836339707:policy/grafana-monitoring",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "grafana-monitoring-role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROA27623IX5VPZGFMCYH" -> null

      - inline_policy {}
    }

  # aws_iam_role_policy_attachment.grafana_monitoring has been deleted
  - resource "aws_iam_role_policy_attachment" "grafana_monitoring" {
      - id         = "grafana-monitoring-role-20220522140202339700000001" -> null
      - policy_arn = "arn:aws:iam::755836339707:policy/grafana-monitoring" -> null
      - role       = "grafana-monitoring-role" -> null
    }

  # aws_iam_user.grafana_monitoring has been deleted
  - resource "aws_iam_user" "grafana_monitoring" {
      - arn           = "arn:aws:iam::755836339707:user/grafana-monitoring" -> null
      - force_destroy = false -> null
      - id            = "grafana-monitoring" -> null
      - name          = "grafana-monitoring" -> null
      - path          = "/" -> null
      - tags          = {} -> null
      - tags_all      = {} -> null
      - unique_id     = "AIDA27623IX56KW62AEIQ" -> null
    }

  # aws_s3_bucket.lambda_source has changed
  ~ resource "aws_s3_bucket" "lambda_source" {
        id                          = "mersthamcc-accounts-deployment-versioned"
      + tags                        = {}
        # (10 unchanged attributes hidden)


      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = 0
          + enabled                                = true
          + id                                     = "version-expiry"
          + tags                                   = {}

          + noncurrent_version_expiration {
              + days = 5
            }
        }

      ~ versioning {
          ~ enabled    = false -> true
            # (1 unchanged attribute hidden)
        }
        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.grafana_monitoring_assume_role will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "grafana_monitoring_assume_role"  {
      ~ id      = "610604643" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::755836339707:user/grafana-monitoring"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          - resources     = [] -> null
            # (2 unchanged attributes hidden)

          - principals {
              - identifiers = [
                  - "arn:aws:iam::755836339707:user/grafana-monitoring",
                ] -> null
              - type        = "AWS" -> null
            }
          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # aws_iam_access_key.grafana_monitoring will be created
  + resource "aws_iam_access_key" "grafana_monitoring" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = (known after apply)
    }

  # aws_iam_policy.grafana_monitoring will be created
  + resource "aws_iam_policy" "grafana_monitoring" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "grafana-monitoring"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "cloudwatch:ListMetrics",
                          + "cloudwatch:GetMetricStatistics",
                          + "cloudwatch:GetMetricData",
                          + "cloudwatch:DescribeAlarmsForMetric",
                          + "cloudwatch:DescribeAlarms",
                          + "cloudwatch:DescribeAlarmHistory",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowReadingMetricsFromCloudWatch"
                    },
                  + {
                      + Action   = [
                          + "logs:StopQuery",
                          + "logs:StartQuery",
                          + "logs:GetQueryResults",
                          + "logs:GetLogGroupFields",
                          + "logs:GetLogEvents",
                          + "logs:DescribeLogGroups",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowReadingLogsFromCloudWatch"
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeTags",
                          + "ec2:DescribeRegions",
                          + "ec2:DescribeInstances",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowReadingTagsInstancesRegionsFromEC2"
                    },
                  + {
                      + Action   = "tag:GetResources"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowReadingResourcesForTags"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role.grafana_monitoring will be created
  + resource "aws_iam_role" "grafana_monitoring" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "grafana-monitoring-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.grafana_monitoring will be created
  + resource "aws_iam_role_policy_attachment" "grafana_monitoring" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "grafana-monitoring-role"
    }

  # aws_iam_user.grafana_monitoring will be created
  + resource "aws_iam_user" "grafana_monitoring" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "grafana-monitoring"
      + path          = "/"
      + tags_all      = (known after apply)
      + unique_id     = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ grafana_monitoring_access_key      = "AKIA27623IX5QEPXMUP5" -> (known after apply)
  ~ grafana_monitoring_assume_role_arn = "arn:aws:iam::755836339707:role/grafana-monitoring-role" -> (known after apply)
  # Warning: this attribute value will be marked as sensitive and will not
  # display in UI output after applying this change.
  ~ grafana_monitoring_secret_key      = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>